[A_Item.Aster_Seraph_Antagonist_Shield:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="[skill]Deflects[-skill] enemy bullets, sending them flying toward [skill]nearby enemies[-skill]."

[A_Item.Aster_Seraph_Antagonist_Shield:AttributePresentationDefinition_8 AttributePresentationDefinition]
Description="Launches [slag]Slag[-slag] homing balls at attackers."

[A_Item.Aster_Seraph_Blockade_Shield:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Provides [skill]major damage resistance[-skill] when fully charged, and [skill]moderate damage resistance[-skill] when not fully charged."
